CKeyFrame.m_pExistingKeyFrame
Stores a pointer to an existing keframe. This keyframe is added to storyboard with m_offset to the existing keyframe.

CKeyFrame.m_pTransition
Stores a pointer to transtion that begins at this keyframe.